validation/couetteSlip/constant/moldingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Couette shear-heating validation: the process groups are present only
    because moldingFoam requires them. The packing group never drives a
    boundary here (there are no molding inlet/vent patches); the ejection
    temperature is set below any reachable value so the run stops at
    endTime. The viscous-dissipation source is enabled explicitly.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      moldingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    meltTemperature  480;
}

packing
{
    switchFraction   1;
    switchPressure   1e9;

    pressure
    {
        type            constant;
        value           1e5;
    }
}

cooling
{
    ejectionTemperature  100;
    releasePressure      1e5;
}

viscousDissipation  false;

// ************************************************************************* //
