validation/couetteSlip/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Temperature: uniform 480 K, all walls adiabatic so the viscous
    dissipation accumulates in the fluid.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 480;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }
}

// ************************************************************************* //
